---
kind: method
id: M:Autodesk.Revit.DB.IFC.IFCRange.#ctor(System.Double,System.Double)
source: html/06d488f2-3fc0-0e15-8048-116c7ce00d5f.htm
---
# Autodesk.Revit.DB.IFC.IFCRange.#ctor Method

Instantiates an IFCRange object.

## Syntax (C#)
```csharp
public IFCRange(
	double start,
	double end
)
```

## Parameters
- **start** (`System.Double`) - The starting value of the range.
- **end** (`System.Double`) - The ending value of the range.